2011/demopc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-03 Thu 08:11 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The benefits of a demo PC</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">The benefits of a demo PC</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4e9c247">Introduction</a></li>
<li><a href="#orgdcd315f">The Sprint Review</a></li>
<li><a href="#orgec705aa">The Sprint Review Demo PC</a></li>
<li><a href="#org877394f">Expected feedback</a></li>
<li><a href="#orgfe6ad3e">Benefits</a>
<ul>
<li><a href="#org552e9a0">Pride in the Software</a></li>
<li><a href="#orgdb388c8">Improve Quality</a></li>
<li><a href="#org728607d">Prompt Feedback on Features</a></li>
<li><a href="#org1ec602d">A means of moving towards releasing each sprint</a></li>
</ul>
</li>
<li><a href="#org7d50b63">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4e9c247" class="outline-2">
<h2 id="org4e9c247">Introduction</h2>
<div class="outline-text-2" id="text-org4e9c247">
<p>
Here at cm group, we have adopted scrum as a framework for
developing our elearning authoring tool. Recently we have set up a
demo PC in our kitchen for office based staff, one of the main user
groups for the product, to come and check out our latest development
efforts. This post will attempt to explain why we have done this,
how we hope it will work and the benefits we are hoping to see from
it.
</p>
</div>
</div>

<div id="outline-container-orgdcd315f" class="outline-2">
<h2 id="orgdcd315f">The Sprint Review</h2>
<div class="outline-text-2" id="text-orgdcd315f">
<p>
As many of you know, the Sprint Review is a meeting in scrum where
the previous sprint is Demo'd; ideally to anyone who is interested,
but often only to the product owner. The demo should be a proof that
the Acceptance Criteria for the stories have been met and all parts
of the product's Definition of Done have been completed. As to how
well we are meeting our Definition of Done and how we are improving
and refining it is probably best left to another post.
</p>
</div>
</div>

<div id="outline-container-orgec705aa" class="outline-2">
<h2 id="orgec705aa">The Sprint Review Demo PC</h2>
<div class="outline-text-2" id="text-orgec705aa">
<p>
In order to aid the demo, we have a PC set up solely for demo
purpose, we install our product at the end of the sprint, create a
demo using it (it's handy that the product itself can be used to
manage the demo as well) and demo it to the PO and the team as a
whole. After the Sprint Review the machine then gets placed in the
communal kitchen, a large room, with a rough release notes
accompanying it, yes, we need to sort out automating our release
notes &#x2026;. I shall come back to that. The kitchen is used quite a
lot, so we are hoping that while waiting for kettles to boil or
microwaves to go 'ping' people will take a look and provide
feedback.
</p>
</div>
</div>

<div id="outline-container-org877394f" class="outline-2">
<h2 id="org877394f">Expected feedback</h2>
<div class="outline-text-2" id="text-org877394f">
<p>
Obviously, it goes without saying that we expect feedback in terms
of the product and features, but also we expect feedback on how best
to provide a demo for people. As we have only started this
yesterday, we shall have to wait and see how much prompting for
feedback will be needed, but traditionally, our internal users are
pretty forthcoming with ideas and issues.
</p>
</div>
</div>

<div id="outline-container-orgfe6ad3e" class="outline-2">
<h2 id="orgfe6ad3e">Benefits</h2>
<div class="outline-text-2" id="text-orgfe6ad3e">
</div><div id="outline-container-org552e9a0" class="outline-3">
<h3 id="org552e9a0">Pride in the Software</h3>
<div class="outline-text-3" id="text-org552e9a0">
<p>
Well we are not just doing this to show off our software
&#x2026;&#x2026;. well actually, yes we are, partly. One thing that can often
be lacking in a software team, especially with inherited legacy
code, is a pride in the product itself and this has a massive
negative effect on the quality of the product. Fortunately, this is
not the case at cm group, we are proud of the product as the users
keep telling us that on the whole it is an enjoyable product to use
and gets the job done quickly and well. We want to use this demo PC
as an opportunity to encourage an even greater pride in our
software.
</p>
</div>
</div>

<div id="outline-container-orgdb388c8" class="outline-3">
<h3 id="orgdb388c8">Improve Quality</h3>
<div class="outline-text-3" id="text-orgdb388c8">
<p>
As soon as we start making our output public, there is a greater
desire to ensure the quality of the product. This very much goes
hand in hand with having a pride in the product.
</p>
</div>
</div>

<div id="outline-container-org728607d" class="outline-3">
<h3 id="org728607d">Prompt Feedback on Features</h3>
<div class="outline-text-3" id="text-org728607d">
<p>
As with all agile processes, it is a principal that issues and
feedback should be captured as early as possible. By providing a
demo PC in a public area within the company, users can play with
new features before an official 'release' and provide feedback
early. OK, we do have a way to go before the output from every
sprint is releasable, but we are getting there.
</p>
</div>
</div>

<div id="outline-container-org1ec602d" class="outline-3">
<h3 id="org1ec602d">A means of moving towards releasing each sprint</h3>
<div class="outline-text-3" id="text-org1ec602d">
<p>
As stated above, we are not there yet, but a platform where we are
installing a product for use will encourage to to automate certain
parts of our process, such as Release Notes, that will help us move
towards a releasable product at the end of each sprint.
</p>
</div>
</div>
</div>

<div id="outline-container-org7d50b63" class="outline-2">
<h2 id="org7d50b63">Summary</h2>
<div class="outline-text-2" id="text-org7d50b63">
<p>
I am certain there are many more benefits from having a demo PC,
hopefully I will be able to report back some more as time goes on.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2018-05-03 Thu 08:11</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
